The profile must not cross the axis of revolution.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ProfileCrossesRevolutionAxis { get; }
  Visual Basic
Public Shared ReadOnly Property ProfileCrossesRevolutionAxis As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ProfileCrossesRevolutionAxis {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RevolutionFailures Class
  Autodesk.Revit.DB Namespace